#include <iostream>
using namespace std;
int main()
{
    setlocale(LC_ALL, "rus");
    int n, i, j, h, sum, k, x;
    double res;
    k = 0;
    sum = 0;
    //----------Размерность массива----------
    cout << "n = ";
    cin >> n;
    cout << "h = ";
    cin >> h;
    //---------------------------------------
    //-------------Ввод массива--------------
    int **m = new int *[n];
    for (i = 0; i < n; i++)
        m[i] = new int[n];
    for (i = 0; i < n; i++) {
        for (j = 0; j < h; j++)
        {
            cout << "Введите элемент " << "[" << i << "][" << j << "]  ";
            cin >> m[i][j];
        }
    }
    //---------------------------------------
    //-------------Вывод массива-------------
    for (i = 0; i < n; i++) {
        for (j = 0; j < h; j++) {
            cout << m[i][j] << ' ';
        }
        cout << "\n";
    }
    //---------------------------------------
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < n; j++) {
            if ((j <= i && j <= n-1-i) || (j >= i && j >= n-1-i)) { 
                // если элемент ниже или принадлежит главной и выше или принадлежит побочной
                // или
                // если элемент выше или принадлежит главной и ниже или принадлежит побочной
                if (m[i][j] % 2 !=0) { // проверка четности 
                    sum += m[i][j];
                    k++;
                }
            }
        }
    }
    res = sum / k;
    cout << "Результат: " << res;
}