#include <iostream>
using namespace std;
int main()
{
    setlocale(LC_ALL, "rus");
    int n, i, j, k, c;
    c = 1;
    k = 0;
    //----------Размерность массива----------
    cout << "n = ";
    cin >> n;
    cout << "\n";
    //---------------------------------------
    //-------------Ввод массива--------------
    int** m = new int* [n];
    for (i = 0; i < n; i++) {
        m[i] = new int[n];
    }
    for (i = n - 1; i > -1; i -= 1) {
        if (c % 2 == 0) { // если с четно то заполняем слева направо
            for (j = 0; j < n; j++) {
                m[i][j] = k;
                k++;
            }
        }
        else {// если с нечетно то заполняем справа налево
            for (j = n - 1; j > -1; j -= 1) {
                m[i][j] = k;
                k++;
            }
        }
        c++;// меняем четность 
    }
    //---------------------------------------
    //-------------Ввод массива--------------
    for (i = 0; i < n; i++) {
        for (j = 0; j < n; j++) {
            cout << m[i][j] << ' ';
        }
        cout << "\n";
    }
    //---------------------------------------
}


