#include <iostream>
using namespace std;
int main()
{
	setlocale(LC_ALL, "rus");
    int n, i, j, h;
    //----------Размерность массива----------
    cout << "n = ";
    cin >> n;
    cout << "h = ";
    cin >> h;
    //---------------------------------------
    //-------------Ввод массива--------------
    int** m = new int* [n];
    for (i = 0; i < n; i++)
        m[i] = new int[n];
    for (i = 0; i < n; i++) {
        for (j = 0; j < h; j++)
        {
            cout << "Введите элемент " << "[" << i << "][" << j << "]  ";
            cin >> m[i][j];
        }
    }
    //---------------------------------------
    //-------------Вывод массива-------------
    for (i = 0; i < n; i++) {
        for (j = 0; j < h; j++) {
            cout << m[i][j] << ' ';
        }
        cout << "\n";
    }
    //---------------------------------------
    cout << "\n";
    for (int i = 0; i < n / 2; i++) {//меняем местами строки 
        swap(m[i], m[n-1-i]);

    }
    //-------------Вывод массива-------------
    for (i = 0; i < n; i++) {
        for (j = 0; j < h; j++) {
            cout << m[i][j] << ' ';
        }
        cout << "\n";
    }
    //---------------------------------------
}